<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"55eb85e1509bdb36b5e38099074dd9a2b32d94fd13de7755c5abce883049bc94","plan_job_ref":"Job Plan Airflow DAGs #219 at https://github.com/cal-itp/data-infra/actions/runs/16200103548","plan_out_hash":"85da4b99973951b1215dea720e7ee879eab24041340a62a40aff54d9dfb0c91b","plan_hash":"f9458857a76600c3bb3d39f1a73d7aed2e3e039fd836f14464a31313447a580c","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 20 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/parse_rt_service_alerts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "h7XHCw==" -> (known after apply)
!~      detect_md5hash      = "nYOJGONwX2X51kpC6vr32Q==" -> "different hash"
!~      generation          = 1751416050174309 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt_v2/parse_rt_service_alerts.yml"
!~      md5hash             = "nYOJGONwX2X51kpC6vr32Q==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/parse_rt_service_alerts.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/parse_rt_trip_updates.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "3pBidw==" -> (known after apply)
!~      detect_md5hash      = "PMkAUgXgKXOWI9hAKwcExg==" -> "different hash"
!~      generation          = 1751416049317509 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt_v2/parse_rt_trip_updates.yml"
!~      md5hash             = "PMkAUgXgKXOWI9hAKwcExg==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/parse_rt_trip_updates.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/parse_rt_vehicle_positions.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "EZifwA==" -> (known after apply)
!~      detect_md5hash      = "FQ/VHnykTRe7JRA9zoZ4vg==" -> "different hash"
!~      generation          = 1751416050187970 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt_v2/parse_rt_vehicle_positions.yml"
!~      md5hash             = "FQ/VHnykTRe7JRA9zoZ4vg==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/parse_rt_vehicle_positions.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/validate_rt_service_alerts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "Fx/pFw==" -> (known after apply)
!~      detect_md5hash      = "41SeveP1q/3bry+Qg88IVQ==" -> "different hash"
!~      generation          = 1751416050091368 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt_v2/validate_rt_service_alerts.yml"
!~      md5hash             = "41SeveP1q/3bry+Qg88IVQ==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/validate_rt_service_alerts.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/validate_rt_trip_updates.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "h/soMQ==" -> (known after apply)
!~      detect_md5hash      = "Cka3DO3IMJ0KAedBO3lvSw==" -> "different hash"
!~      generation          = 1751416049283744 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt_v2/validate_rt_trip_updates.yml"
!~      md5hash             = "Cka3DO3IMJ0KAedBO3lvSw==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/validate_rt_trip_updates.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/validate_rt_vehicle_positions.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "x/4ANg==" -> (known after apply)
!~      detect_md5hash      = "yLUP8g09yloVdZVzQpP9hA==" -> "different hash"
!~      generation          = 1751416049287628 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt_v2/validate_rt_vehicle_positions.yml"
!~      md5hash             = "yLUP8g09yloVdZVzQpP9hA==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/validate_rt_vehicle_positions.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/publish_open_data/publish_california_open_data.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "Wx+C0A==" -> (known after apply)
!~      detect_md5hash      = "Dmn2ccrjkUs7GTsL5zO+rw==" -> "different hash"
!~      generation          = 1751416049286660 -> (known after apply)
        id                  = "calitp-staging-composer-dags/publish_open_data/publish_california_open_data.yml"
!~      md5hash             = "Dmn2ccrjkUs7GTsL5zO+rw==" -> (known after apply)
        name                = "dags/publish_open_data/publish_california_open_data.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "BasEhQ==" -> (known after apply)
!~      detect_md5hash      = "eosxYzjG9L4u4S5IV0f/1A==" -> "different hash"
!~      generation          = 1751485822740512 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"
!~      md5hash             = "eosxYzjG9L4u4S5IV0f/1A==" -> (known after apply)
        name                = "dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse/dbt_test.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "H4NkCg==" -> (known after apply)
!~      detect_md5hash      = "FouUSkAANNBrkR8YlEDyLA==" -> "different hash"
!~      generation          = 1751416050156728 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse/dbt_test.yml"
!~      md5hash             = "FouUSkAANNBrkR8YlEDyLA==" -> (known after apply)
        name                = "dags/transform_warehouse/dbt_test.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "DUC0og==" -> (known after apply)
!~      detect_md5hash      = "VyW21SypkxM2yjLri8T9Xw==" -> "different hash"
!~      generation          = 1751485822725663 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"
!~      md5hash             = "VyW21SypkxM2yjLri8T9Xw==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh/dbt_test.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "q7AdIw==" -> (known after apply)
!~      detect_md5hash      = "7xSa1VEHgG31ghW+WD5pdw==" -> "different hash"
!~      generation          = 1751416050059303 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh/dbt_test.yml"
!~      md5hash             = "7xSa1VEHgG31ghW+WD5pdw==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh/dbt_test.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "lpo4KQ==" -> (known after apply)
!~      detect_md5hash      = "t4dlQ4mkxjU6Cr2r/t7YGw==" -> "different hash"
!~      generation          = 1751485822728669 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"
!~      md5hash             = "t4dlQ4mkxjU6Cr2r/t7YGw==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "ue2ydg==" -> (known after apply)
!~      detect_md5hash      = "GeCgM2T4uEKLSZGGNvpCUA==" -> "different hash"
!~      generation          = 1751485822730175 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"
!~      md5hash             = "GeCgM2T4uEKLSZGGNvpCUA==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "MtpAFg==" -> (known after apply)
!~      detect_md5hash      = "V+KHT2/A37WtMuMEGGosxg==" -> "different hash"
!~      generation          = 1751416049317511 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml"
!~      md5hash             = "V+KHT2/A37WtMuMEGGosxg==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "1zJXSA==" -> (known after apply)
!~      detect_md5hash      = "QMcwLpE+GqH075eTyG9vPQ==" -> "different hash"
!~      generation          = 1751416049285934 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml"
!~      md5hash             = "QMcwLpE+GqH075eTyG9vPQ==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/unzip_and_validate_gtfs_schedule_hourly/validate_gtfs_schedule.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "WAOTIw==" -> (known after apply)
!~      detect_md5hash      = "Q2KZHpa145QxEt0qrMVrvQ==" -> "different hash"
!~      generation          = 1751929677147947 -> (known after apply)
        id                  = "calitp-staging-composer-dags/unzip_and_validate_gtfs_schedule_hourly/validate_gtfs_schedule.yml"
!~      md5hash             = "Q2KZHpa145QxEt0qrMVrvQ==" -> (known after apply)
        name                = "dags/unzip_and_validate_gtfs_schedule_hourly/validate_gtfs_schedule.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "T9xLgw==" -> (known after apply)
!~      detect_md5hash      = "RZff0J+b/Jka5frQF+tGBw==" -> "different hash"
!~      generation          = 1752103418450207 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "RZff0J+b/Jka5frQF+tGBw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["profiles.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "fcYfVw==" -> (known after apply)
!~      detect_md5hash      = "8XK0sntGMFxIy7Ve/HuJzg==" -> "different hash"
!~      generation          = 1749663111897003 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/profiles.yml"
!~      md5hash             = "8XK0sntGMFxIy7Ve/HuJzg==" -> (known after apply)
        name                = "data/warehouse/profiles.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "2RBKew==" -> (known after apply)
!~      detect_md5hash      = "GBSeTJZJB4kNiTmdZKGGYA==" -> "different hash"
!~      generation          = 1752103419653909 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "GBSeTJZJB4kNiTmdZKGGYA==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-partial_parse" {
!~      content             = (sensitive value)
!~      crc32c              = "KvxdLg==" -> (known after apply)
!~      detect_md5hash      = "kh10Bt2VtvG+0yNnA5q1/Q==" -> "different hash"
!~      generation          = 1752103419390838 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/partial_parse.msgpack"
!~      md5hash             = "kh10Bt2VtvG+0yNnA5q1/Q==" -> (known after apply)
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 20 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #219](https://github.com/cal-itp/data-infra/actions/runs/16200103548)